@echo off
rem ============================================================================
rem  Copyright　Information Services International-Dentsu, Ltd.
rem ============================================================================
rem 
rem  SYSTEM        : BANK・R－CC
rem 
rem  PROGRAM NAME  : 音声ファイルリリースプログラム起動用バッチ
rem 
rem  MODULE NAME   : ReleaseFile_ForWAV.bat
rem 
rem  INPUT         : 可変
rem 
rem  EXIT          : PowerShellの $LASTEXITCODE
rem                  正常終了 ・・・ NORMAL(0)　
rem                  異常終了 ・・・ ERROR (9)
rem 
rem  Mod   yy/mm/dd   Coder           Comment
rem -----+----------+---------------+-------------------------------------------
rem  %00 | 14/05/14 | ISID          | First Edition.
rem ============================================================================

rem ============================================================================
rem  初期処理
rem ============================================================================

rem ---------------------------------------
rem  環境変数のローカライズ開始
rem ---------------------------------------
setlocal

rem ---------------------------------------
rem  起動用環境変数セット
rem ---------------------------------------
rem  PowerShell 64 bit 
rem ---------------------------------------
set POWERSHELL=C:\Windows\syswow64\WindowsPowerShell\v1.0\powershell.exe
set EXIT_PROC=;exit $LASTEXITCODE
set PS_PATH=D:\azbk\unyo\tools\
set SUFFIX=.ps1
set PGM=uy_releas_sound_files

rem ============================================================================
rem  コーリングシーケンス作成
rem ============================================================================
rem ---------------------------------------
rem  プログラム名
rem ---------------------------------------
set PGM_NAME=%PS_PATH%%PGM%%SUFFIX%
set MYPARM=
set SPACE= 

rem ---------------------------------------
rem  POWERSHELLからの起動
rem ---------------------------------------
set RUN_PGM=%POWERSHELL%%SPACE%%PGM_NAME%%SPACE%%MYPARM%%EXIT_PROC%

rem ============================================================================
rem  プログラム実行(EXIT付き)
rem ============================================================================
call %RUN_PGM%

rem ============================================================================
rem  終了
rem ============================================================================
exit /B %ERRORLEVEL%
